base/Catalogs/бит_ПользовательскиеФункции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПользовательскиеФункции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодпрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВозвращаемогоЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_КонтекстыВыполненияПользовательскихФункций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Comment>Версия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеОбязательныйДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
					<Comment>Переменные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ПользовательскиеФункции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФинГрафики_СуммаОсновногоДолгаАннуитетныйПоДням";
	Элемент.Код 					  = "000000000000003";
	Элемент.КодПодпрограммы = 
		"
		|	КоличествоДнейВГоду  = Окр((КонецГода(ДанныеПериодаРасчета.ПериодОплатыПред)-НачалоГода(ДанныеПериодаРасчета.ПериодОплатыПред))/60/60/24);
		|
		|	КоличествоДнейОплаты = Число(ДанныеПериодаРасчета.Период-ДанныеПериодаРасчета.ПериодОплатыПред)/60/60/24;
		|
		|	ПС_Проценты = (ПараметрыПлатежа.ПроцентнаяСтавка / 100 / КоличествоДнейВГоду)*КоличествоДнейОплаты;
		|	ПС_ПлатежЗаПериод = ПараметрыПлатежа.ПроцентнаяСтавка / 100 / 12;
		|
		|	Знаменатель = Pow(1+ПС_ПлатежЗаПериод,ДанныеПериодаРасчета.КоличествоПериодовВыплат)-1;
		|                              
		|	ПлатежЗаПериод = ДанныеПериодаРасчета.СуммаТранша * (ПС_ПлатежЗаПериод + (ПС_ПлатежЗаПериод / Знаменатель));
		|
		|	ПлатежЗаПериод = Окр(ПлатежЗаПериод,2);
		|
		|	ПроцентыПоКредиту = Окр(ДанныеПериодаРасчета.ЗадолженностьПоОсновномуДолгу * ПС_Проценты,2);
		|
		|	Результат = ПлатежЗаПериод - ПроцентыПоКредиту;
		|
		|	Если ДанныеПериодаРасчета.ЭтоПоследнийПлатеж Тогда
		|   	Отклонение = Результат - ДанныеПериодаРасчета.ЗадолженностьПоОсновномуДолгу;
		|		Если Отклонение < 10 ИЛИ Отклонение > -10 Тогда
		|          	Результат = ДанныеПериодаРасчета.ЗадолженностьПоОсновномуДолгу;
		|		КонецЕсли;
		|	КонецЕсли;";
	
	Элемент.Контекст	 = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ФинансовыеДоговора;
	Элемент.Наименование = НСтр("ru = 'Расчет суммы основного долга (аннуитетный по дням)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Описание 	 = НСтр("ru = 'Расчет суммы основного долга аннуитетным способом по дням'", ОбщегоНазначения.КодОсновногоЯзыка());
    Элемент.Релиз		 = "1.0.0.0";
	Элемент.Родитель 	 = Справочники.бит_ПользовательскиеФункции.ФинансовыеГрафики;

	Элемент.ПараметрыФункции = ТабличныеЧасти.ПараметрыФункции.Скопировать();
	ЭлементТЧ 							  = Элемент.ПараметрыФункции.Добавить();
	ЭлементТЧ.Наименование 				  = НСтр("ru = 'ПараметрыПлатежа'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЭлементТЧ.НеОбязательныйДляЗаполнения = Ложь; 
	
	ЭлементТЧ							  = Элемент.ПараметрыФункции.Добавить();
	ЭлементТЧ.Наименование 				  = НСтр("ru = 'ДанныеПериодаРасчета'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЭлементТЧ.НеОбязательныйДляЗаполнения = Ложь;

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ФинГрафики_СуммаПроцентовПоДням";
	Элемент.Код 					  = "000000000000002";
	Элемент.КодПодпрограммы = 
		"
		|	КоличествоДнейВГоду = Окр((КонецГода(ДанныеПериодаРасчета.ПериодОплатыПред)-НачалоГода(ДанныеПериодаРасчета.ПериодОплатыПред))/60/60/24);
		|        
		|	КоличествоДнейОплаты = Число(ДанныеПериодаРасчета.Период-ДанныеПериодаРасчета.ПериодОплатыПред)/60/60/24;
		|                             
		|	Результат = ДанныеПериодаРасчета.ЗадолженностьПоОсновномуДолгу * (ПараметрыПлатежа.ПроцентнаяСтавка / 100 / КоличествоДнейВГоду)*КоличествоДнейОплаты;";
	
	Элемент.Контекст	 = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ФинансовыеДоговора;
	Элемент.Наименование = НСтр("ru = 'Расчет суммы процентов (по дням)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент.Описание 	 = НСтр("ru = 'Расчет суммы процентов дифференцированным способом по дням'", ОбщегоНазначения.КодОсновногоЯзыка());
    Элемент.Релиз		 = "1.0.0.0";
	Элемент.Родитель	 = Справочники.бит_ПользовательскиеФункции.ФинансовыеГрафики;

	Элемент.ПараметрыФункции = ТабличныеЧасти.ПараметрыФункции.Скопировать();
	ЭлементТЧ							  = Элемент.ПараметрыФункции.Добавить();
	ЭлементТЧ.Наименование				  = НСтр("ru = 'ПараметрыПлатежа'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЭлементТЧ.НеОбязательныйДляЗаполнения = Ложь;   
	
	ЭлементТЧ							  = Элемент.ПараметрыФункции.Добавить();
	ЭлементТЧ.Наименование				  = НСтр("ru = 'ДанныеПериодаРасчета'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЭлементТЧ.НеОбязательныйДляЗаполнения = Ложь;

КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

// Функция формирует структуру заголовков для элемента справочника.
// 
Функция ПолучитьНазваниеПодпрограммыСПараметрами(Ссылка) Экспорт
	
	// Значения элементов структуры:
	// 
	// 	- ЗаголовокФункции: Функция МояФункция(Параметр1, Параметр2).
	// 	- НазваниеСПараметрами: МояФункция(Параметр1, Параметр2).
	// 	- ОписаниеПараметров: // Типы входных параметров: 
	// 						  // Параметр1 - 'Число'.
	// 						  // Параметр2 - 'Строка'.
	СтруктураПараметров = Новый Структура("ЗаголовокФункции,НазваниеСПараметрами,ОписаниеПараметров");
	
	ТекстНазвания = СокрЛП(Ссылка.Наименование) + "(";
	ТекстКомментария 	= "// Типы входных параметров: ";
	
	Для Каждого Параметр Из Ссылка.ПараметрыФункции Цикл
		
		ТекстНазвания = ТекстНазвания + СокрЛП(Параметр.Наименование);
		
		Если Параметр.НеОбязательныйДляЗаполнения Тогда
			ТекстНазвания = ТекстНазвания + " = Неопределено";
		КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("ДанныеФормыСтруктура") Тогда
			ОписаниеТипаПараметра = "";
		Иначе
			ОписаниеТипаПараметра = СокрЛП(Параметр.ТипПараметра.Получить());
		КонецЕсли;
		
		ТекстКомментария = ТекстКомментария + Символы.ПС + "// " + СокрЛП(Параметр.Наименование) + " - " + "'" + ОписаниеТипаПараметра + "'";
		
		Если НЕ Параметр.НомерСтроки = Ссылка.ПараметрыФункции.Количество() Тогда
			ТекстНазвания = ТекстНазвания + ", ";
		КонецЕсли;	
		
	КонецЦикла;
	
	ТекстНазвания = ТекстНазвания + ")";
	
	СтруктураПараметров.ЗаголовокФункции	 = "Функция " + ТекстНазвания;
	СтруктураПараметров.НазваниеСПараметрами = ТекстНазвания;
	СтруктураПараметров.ОписаниеПараметров	 = ТекстКомментария;
	
	Возврат СтруктураПараметров;
	
КонецФункции	

// Процедура заполняет параметры функции для переданного объекта.
// 
// Параметры:
// 	Объект - ДанныеФормыСтруктура, СправочникОбъект.бит_ПользовательскиеФункции.
// 
Процедура ЗаполнитьПараметры(Объект) Экспорт
	
	Если Объект.Контекст = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ЗависимыеОбороты Тогда
		
		Объект.ПараметрыФункции.Очистить();
		ДобавитьПараметрыЗависимыеОбороты(Объект);
	
	ИначеЕсли Объект.Контекст = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ЗагрузкаЭксель Тогда	
		
		Объект.ПараметрыФункции.Очистить();		
		ДобавитьПараметрыЗагрузкаЭксель(Объект);
		
	ИначеЕсли Объект.Контекст = Перечисления.бит_КонтекстыВыполненияПользовательскихФункций.ФинансовыеДоговора Тогда
		
		Объект.ПараметрыФункции.Очистить();
		ДобавитьПараметрыФинансовыеДоговора(Объект);	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет добавляет параметр при отсутствии. 
// 
// Параметры:
//  ИмяПараметра - Строка.
// 
Процедура НайтиДобавитьПараметр(Объект, ИмяПараметра)

	СтрОтбор = Новый Структура("Наименование",ИмяПараметра);
   	МассивСтрок = Объект.ПараметрыФункции.НайтиСтроки(СтрОтбор);
	
	Если МассивСтрок.Количество() = 0 Тогда
	
		НоваяСтрока = Объект.ПараметрыФункции.Добавить();
		НоваяСтрока.Наименование = ИмяПараметра;
	
	КонецЕсли; 

КонецПроцедуры // НайтиДобавитьПараметр()

// Процедура добавляет параметры, необходимые для контекста ЗависимыеОбороты.
// 
// 
Процедура ДобавитьПараметрыЗависимыеОбороты(Объект)

	НайтиДобавитьПараметр(Объект, "НастройкаРасчета");
	НайтиДобавитьПараметр(Объект, "СтрокаИсточник");
	НайтиДобавитьПараметр(Объект, "СтрокаПриемник");
	// Изменение кода. Начало. 07.05.2018{{
	НайтиДобавитьПараметр(Объект, "Сценарий");
	// Изменение кода. Конец. 07.05.2018}}

КонецПроцедуры // ДобавитьПараметрыЗависимыеОбороты()

// Процедура добавляет параметры, необходимые для контекста ЗагрузкаЭксель.
// 
// 
Процедура ДобавитьПараметрыЗагрузкаЭксель(Объект)

	НайтиДобавитьПараметр(Объект, "СтрокаЗагрузки");
	НайтиДобавитьПараметр(Объект, "ДанныеЗагрузки");
	НайтиДобавитьПараметр(Объект, "СтрокаПравил");

КонецПроцедуры // ДобавитьПараметрыЗагрузкаЭксель() 

// Процедура добавляет параметры, необходимые для контекста ФинансовыеДоговора.
// 
// 
Процедура ДобавитьПараметрыФинансовыеДоговора(Объект)

	НайтиДобавитьПараметр(Объект, "ПараметрыПлатежа");
	НайтиДобавитьПараметр(Объект, "ДанныеПериодаРасчета");

КонецПроцедуры // ДобавитьПараметрыЗагрузкаЭксель() 

#КонецОбласти
 
#КонецЕсли
